from random import randint

x=randint(0,100)

count_perebor=0
#РјРµС‚РѕРґ РїРѕСЃР»РµРґРѕРІР°С‚РµР»СЊРЅРѕРіРѕ РїРµСЂРµР±РѕСЂР°
for i in range(0,101):
    count_perebor+=1
    if i==x:
        print("Р§РёСЃР»Рѕ РЅР°Р№РґРµРЅРѕ!")
        break

#print("Р—Р°РіР°РґР°РЅРЅРѕРµ С‡РёСЃР»Рѕ Р±С‹Р»Рѕ ",x, " Рё РґР»СЏ РµРіРѕ РїРѕРёСЃРєР° РїРµСЂРµР±РѕСЂРѕРј РїРѕС‚СЂРµР±РѕРІР°Р»РѕСЃСЊ ", count_perebor, " РёС‚РµСЂР°С†РёР№ ")


count_random=1
#РјРµС‚РѕРґ СЃР»СѓС‡Р°Р№РЅРѕРіРѕ РѕС‚РіР°РґС‹РІР°РЅРёСЏ
y=randint(0,100)
while x!=y:
    y=randint(0,100)
    count_random+=1

#print("Р—Р°РіР°РґР°РЅРЅРѕРµ С‡РёСЃР»Рѕ Р±С‹Р»Рѕ ",x, " Рё РґР»СЏ РµРіРѕ РїРѕРёСЃРєР° СѓРіР°РґС‹РІР°РЅРёРµРј РїРѕС‚СЂРµР±РѕРІР°Р»РѕСЃСЊ ", count_random, " РёС‚РµСЂР°С†РёР№ ")
from random import randint
right=10000000
left=0

array=[1,3,5,8,11,55,66,100]

array2=[555,22,3,1,44,2,33,6,55,100]

x=randint(left,right)


count_bin=1
print('Р”Р°РІР°Р№ РЅР°С‡РЅРµРј РёРіСЂСѓ - СѓРіР°РґР°Р№ С‡РёСЃР»Рѕ РѕС‚ 0 РґРѕ 100')

mid=(right + left) // 2


while x!=mid:
    print(mid)
    if x<mid: 
        print("РјРµРЅСЊС€Рµ")
        right=mid-1
    else: 
        print("Р±РѕР»СЊС€Рµ")
        left=mid+1
    mid=(right + left) // 2
   # y=int(input('Р’РІРµРґРё С‡РёСЃР»Рѕ'))
    count_bin+=1
print("Р—Р°РіР°РґР°РЅРЅРѕРµ С‡РёСЃР»Рѕ Р±С‹Р»Рѕ ",x, " Рё РґР»СЏ РµРіРѕ РїРѕРёСЃРєР° Р±РёРЅР°СЂРЅС‹Рј Р°Р»РіРѕСЂРёС‚РјРѕРј РїРѕС‚СЂРµР±РѕРІР°Р»РѕСЃСЊ ", count_bin, " РёС‚РµСЂР°С†РёР№ ")

